In [1]:
import sqlite3 as sql

In [ ]:
connection = sql.connect('example.db') # Create a connection to the SQLite database
connection

In [ ]:
cursor = connection.cursor() # Create a cursor object to execute SQL commands

In [ ]:
cursor.execute(''' 
               Create Table If Not Exists employees(
                   id Integer Primary Key,
                   name Text Not Null,
                   age Integer,
                   department Text
               )
''') # Create the table if it doesn't exist
connection.commit() # Commit the changes to the database

In [ ]:
cursor.execute('''
               Select * from employees
''') # Select all records from the table

In [12]:
cursor.execute('''
               Insert Into employees(name, age, department)
               values('Jiban Jyoti Mohanty', 22, 'Fullstack Developer')
''')

cursor.execute('''
               Insert Into employees(name, age, department)
               values('Krish', 23, 'Finance')
''')

cursor.execute('''
               Insert Into employees(name, age, department)
               values('Akhilesh Kumar', 35, 'Product Analyst')
''')

In [14]:
cursor.execute('''
               Select * From employees
''')
rows = cursor.fetchall() # Fetch all records from the table
for row in rows:
    print(row)

(1, 'Jiban Jyoti Mohanty', 22, 'Fullstack Developer')
(2, 'Krish', 23, 'Finance')
(3, 'Akhilesh Kumar', 35, 'Product Analyst')

In [17]:
cursor.execute('''
               Update employees set age = 30 where name = 'Krish'
''')
connection.commit() # Commit the changes to the database

In [19]:
cursor.execute('''
               Select * From employees
''')
rows = cursor.fetchall() # Fetch all records from the table
for row in rows:
    print(row)

(1, 'Jiban Jyoti Mohanty', 22, 'Fullstack Developer')
(2, 'Krish', 30, 'Finance')
(3, 'Akhilesh Kumar', 35, 'Product Analyst')

In [22]:
cursor.execute('''
               Delete from employees where name = 'Akhilesh Kumar'
''')
connection.commit() # Commit the changes to the database
# Fetch all records from the table
cursor.execute('''
               Select * From employees
''')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Jiban Jyoti Mohanty', 22, 'Fullstack Developer')
(2, 'Krish', 30, 'Finance')

In [21]:
connection = sql.connect('sales_data.db') # Create a connection to the SQLite database
cursor = connection.cursor() # Create a cursor object to execute SQL commands
cursor.execute('''
               CREATE TABLE IF NOT EXISTS sales(
                   id INTEGER PRIMARY KEY,
                   date TEXT NOT NULL,
                   product text NOT NULL,
                   sales Integer,
                   region TEXT 

               )
''')

sales_data = [
    ('2023-01-01', 'Product A', 100, 'North'),
    ('2023-01-02', 'Product B', 150, 'South'),
    ('2023-01-03', 'Product C', 200, 'East'),
    ('2023-01-04', 'Product D', 250, 'West'),
    ('2023-01-05', 'Product E', 300, 'North'),
    ('2023-01-06', 'Product F', 350, 'South'),
    ('2023-01-07', 'Product G', 400, 'East'),
    ('2023-01-08', 'Product H', 450, 'West'),
]
connection.commit() # Commit the changes to the database

In [23]:
cursor.executemany('''
                   Insert Into sales(date, product, sales, region)
                   values(?, ?, ?, ?)
''', sales_data) # Insert multiple records into the table
connection.commit() # Commit the changes to the database

In [25]:
cursor.execute('''
               Select * from sales
''') # Select all records from the table
rows = cursor.fetchall() # Fetch all records from the table
for row in rows:
    print(row)

(1, '2023-01-01', 'Product A', 100, 'North')
(2, '2023-01-02', 'Product B', 150, 'South')
(3, '2023-01-03', 'Product C', 200, 'East')
(4, '2023-01-04', 'Product D', 250, 'West')
(5, '2023-01-05', 'Product E', 300, 'North')
(6, '2023-01-06', 'Product F', 350, 'South')
(7, '2023-01-07', 'Product G', 400, 'East')
(8, '2023-01-08', 'Product H', 450, 'West')

In [26]:
connection.close() # Close the connection to the database